Mysteo91/stm32-periph-utils/lib/uartCircularHw/src/user_layer/uartHw.c
//
// Created by user on 07.05.2025.
//
#include "uartHw.h"
#include "uart_gpio.h"
#include <string.h>
#include "stm32h5xx_hal.h"


typedef enum {
    DMA_USING_FOR_NONE,
    DMA_USING_FOR_RX,
    DMA_USING_FOR_TX

}DMA_USING_FOR_Enum;

typedef struct {
    DMA_HandleTypeDef  dmaHandleRx;
    DMA_HandleTypeDef  dmaHandleTx;
    DMA_NodeTypeDef    nodeRx;
    DMA_QListTypeDef   listRx;
}dma_t;

typedef struct
{
    UART_HandleTypeDef huart;
    uint8_t* lastWrtPnt;
    uint8_t countOverflowed;
    dma_t dma;
    void  (*userRxCallback)(uint8_t* dataStartAddress, uint8_t* dataContinuesAddress, uint16_t dataLen, uint16_t dataContinuesLen);
    bool inited;
    bool cirularMode;
}uartHw_t;

#ifdef UART1_HW
uartHw_t uart1 = {
    .huart.Instance = USART1,
    .huart.Init = {
            .Mode = UART1_HW_MODE,
            .HwFlowCtl = UART1_HW_FLOW_CONTROL
    }
};
#endif

#ifdef UART2_HW
uartHw_t uart2 = {
    .huart.Instance = USART2,
    .huart.Init = {
        .Mode = UART2_HW_MODE,
        .HwFlowCtl = UART2_HW_FLOW_CONTROL
    }
};
#endif

#ifdef UART3_HW
uartHw_t uart3 = {
    .huart.Instance = USART3,
    .huart.Init = {
        .Mode = UART3_HW_MODE,
        .HwFlowCtl = UART3_HW_FLOW_CONTROL
    }
};
#endif

#ifdef UART4_HW
uartHw_t uart4 = {
    .huart.Instance = USART4,
    .huart.Init = {
        .Mode = UART4_HW_MODE,
        .HwFlowCtl = UART4_HW_FLOW_CONTROL
    }
};
#endif

#ifdef UART5_HW
uartHw_t uart5 = {
    .huart.Instance = UART5,
    .huart.Init = {
        .Mode = UART5_HW_MODE,
        .HwFlowCtl = UART5_HW_FLOW_CONTROL
    }
};
#endif

#ifdef UART6_HW
uartHw_t uart6 = {
    .huart.Instance = USART6,
    .huart.Init = {
        .Mode = UART2_HW_MODE,
        .HwFlowCtl = UART6_HW_FLOW_CONTROL
    }
};
#endif



static void deinitUartHw(uartHw_t *uartHw);
static void enableClkGPIO(GPIO_TypeDef *port);
static void initUartGPIO(GPIO_TypeDef *port, uint32_t pin, uint8_t alternateFunction, uint8_t gpioSpeed);
static void initDmaForUART(DMA_HandleTypeDef *dmaHandle, uint32_t DMA_REQUEST, uint32_t DMA_CCR);
static void initDmaCircularForUART(DMA_HandleTypeDef *dmaHandle, uint32_t DMA_REQUEST, uint32_t DMA_CCR);
static void setPriorityDMA(DMA_Channel_TypeDef* dmaChannel, uint8_t priority);


UART_HandleTypeDef *getUartHalHandleByUSART(USART_TypeDef *usart) {

#ifdef UART1_HW
    if (uart1.huart.Instance == usart) {
        return &uart1.huart;
    }
#endif
#ifdef UART2_HW
    if (uart2.huart.Instance == usart) {
        return &uart2.huart;
    }
#endif
#ifdef UART3_HW
    if (uart3.huart.Instance == usart) {
        return &uart3.huart;
    }
#endif
#ifdef UART4_HW
    if (uart4.huart.Instance == usart) {
        return &uart4.huart;
    }
#endif
#ifdef UART5_HW
    if (uart5.huart.Instance == usart) {
        return &uart5.huart;
    }
#endif
#ifdef UART6_HW
    if (uart6.huart.Instance == usart) {
        return &uart6.huart;
    }
#endif

    return NULL;
}

static UART_HandleTypeDef* getUartHalHandleByDMA (DMA_Channel_TypeDef *dma) {

#ifdef UART1_HW
    if(uart1.dma.dmaHandleRx.Instance == dma) {
        return &uart1.huart;
    }
    if (uart1.dma.dmaHandleTx.Instance == dma) {
        return &uart1.huart;
    }
#endif
#ifdef UART2_HW
    if(uart2.dma.dmaHandleRx.Instance == dma) {
        return &uart2.huart;
    }
    if (uart2.dma.dmaHandleTx.Instance == dma) {
        return &uart2.huart;
    }
#endif
#ifdef UART3_HW
    if(uart3.dma.dmaHandleRx.Instance == dma) {
        return &uart3.huart;
    }
    if (uart3.dma.dmaHandleTx.Instance == dma) {
        return &uart3.huart;
    }
#endif
#ifdef UART4_HW
    if(uart4.dma.dmaHandleRx.Instance == dma) {
        return &uart4.huart;
    }
    if (uart4.dma.dmaHandleTx.Instance == dma) {
        return &uart4.huart;
    }
#endif
#ifdef UART5_HW
    if(uart5.dma.dmaHandleRx.Instance == dma) {
        return &uart5.huart;
    }
    if (uart5.dma.dmaHandleTx.Instance == dma) {
        return &uart5.huart;
    }
#endif
#ifdef UART6_HW
    if(uart6.dma.dmaHandleRx.Instance == dma) {
        return &uart6.huart;
    }
    if (uart6.dma.dmaHandleTx.Instance == dma) {
        return &uart6.huart;
    }
#endif
    while (1) {
        //@todo ERROR_HANDLER for debug only
    }
}



static DMA_USING_FOR_Enum dmaUsingFor(DMA_Channel_TypeDef *dma) {

#ifdef UART1_HW
    if(uart1.dma.dmaHandleRx.Instance == dma) {
        return DMA_USING_FOR_RX;
    }
    if (uart1.dma.dmaHandleTx.Instance == dma) {
        return DMA_USING_FOR_TX;
    }
#endif
#ifdef UART2_HW
    if(uart2.dma.dmaHandleRx.Instance == dma) {
        return DMA_USING_FOR_RX;
    }
    if (uart2.dma.dmaHandleTx.Instance == dma) {
        return DMA_USING_FOR_TX;
    }
#endif
#ifdef UART3_HW
    if(uart3.dma.dmaHandleRx.Instance == dma) {
        return DMA_USING_FOR_RX;
    }
    if (uart3.dma.dmaHandleTx.Instance == dma) {
        return DMA_USING_FOR_TX;
    }
#endif
#ifdef UART4_HW
    if(uart4.dma.dmaHandleRx.Instance == dma) {
        return DMA_USING_FOR_RX;
    }
    if (uart4.dma.dmaHandleTx.Instance == dma) {
        return DMA_USING_FOR_TX;
    }
#endif
#ifdef UART5_HW
    if(uart5.dma.dmaHandleRx.Instance == dma) {
        return DMA_USING_FOR_RX;
    }
    if (uart5.dma.dmaHandleTx.Instance == dma) {
        return DMA_USING_FOR_TX;
    }
#endif
#ifdef UART6_HW
    if(uart6.dma.dmaHandleRx.Instance == dma) {
        return DMA_USING_FOR_RX;
    }
    if (uart6.dma.dmaHandleTx.Instance == dma) {
        return DMA_USING_FOR_TX;
    }
#endif
    return DMA_USING_FOR_NONE;

}


static uartHw_t *getUartHwByHalHandle(UART_HandleTypeDef *huart) {
#ifdef UART1_HW
    if (&uart1.huart == huart) {
        return &uart1;
    }
#endif
#ifdef UART2_HW
    if (&uart2.huart == huart) {
        return &uart2;
    }
#endif
#ifdef UART3_HW
    if (&uart3.huart == huart) {
        return &uart3;
    }
#endif
#ifdef UART4_HW
    if (&uart4.huart == huart) {
        return &uart4;
    }
#endif
#ifdef UART5_HW
    if (&uart5.huart == huart) {
        return &uart5;
    }
#endif
#ifdef UART6_HW
    if (&uart6.huart == huart) {
        return &uart6;
    }
#endif
    while (1) {
        //@todo ERROR_HANDLER for debug only
    }
}





bool uartHwInit(USART_TypeDef *usart, uint32_t baudrate, DMA_Channel_TypeDef* dmaRx, DMA_Channel_TypeDef* dmaTx, const
                uint8_t NVIC_Priority, bool circularMode) {
    UART_HandleTypeDef* huart = getUartHalHandleByUSART(usart);
    if (huart == NULL) {
        return false;
    }

    uartHw_t* uartHw = getUartHwByHalHandle(huart);
    uartHw->dma.dmaHandleRx.Instance = dmaRx;
    uartHw->dma.dmaHandleTx.Instance = dmaTx;
    uartHw->cirularMode = circularMode;
    huart->Instance = usart;
    huart->Init.BaudRate = baudrate;
    huart->Init.WordLength = UART_WORDLENGTH_8B;
    huart->Init.StopBits = UART_STOPBITS_1;
    huart->Init.Parity = UART_PARITY_NONE;
    huart->Init.Mode = UART_MODE_TX_RX;
    huart->Init.OverSampling = UART_OVERSAMPLING_16;
    huart->Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
    huart->Init.ClockPrescaler = UART_PRESCALER_DIV1;
    huart->AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
    if (HAL_UART_Init(huart) != HAL_OK) {
        return false;
    }
    if (HAL_UARTEx_SetTxFifoThreshold(huart, UART_TXFIFO_THRESHOLD_1_8) != HAL_OK) {
        return false;
    }
    if (HAL_UARTEx_SetRxFifoThreshold(huart, UART_RXFIFO_THRESHOLD_1_8) != HAL_OK) {
        return false;
    }
    if (HAL_UARTEx_DisableFifoMode(huart) != HAL_OK) {
        return false;
    }


    if (usart == USART1) {
        HAL_NVIC_EnableIRQ(USART1_IRQn);
        HAL_NVIC_SetPriority(USART1_IRQn, NVIC_Priority, 0);
    }
    else if (usart == USART2) {
        HAL_NVIC_EnableIRQ(USART2_IRQn);
        HAL_NVIC_SetPriority(USART2_IRQn, NVIC_Priority, 0);
    }
    else if (usart == USART3) {
        HAL_NVIC_EnableIRQ(USART3_IRQn);
        HAL_NVIC_SetPriority(USART3_IRQn, NVIC_Priority, 0);
    }
    else if (usart == UART4) {
        HAL_NVIC_EnableIRQ(UART4_IRQn);
        HAL_NVIC_SetPriority(UART4_IRQn, NVIC_Priority, 0);
    }
    else if (usart == UART5) {
        HAL_NVIC_EnableIRQ(UART5_IRQn);
        HAL_NVIC_SetPriority(UART5_IRQn, NVIC_Priority, 0);
    }
    else if (usart == USART6) {
        HAL_NVIC_EnableIRQ(USART6_IRQn);
        HAL_NVIC_SetPriority(USART6_IRQn, NVIC_Priority, 0);
    }

