Mysteo91/stm32-periph-utils/lib/uartCircularHw/src/user_layer/uartHw.c
        initUartGPIO((GPIO_TypeDef *)UART5_HW_TX_PORT, UART5_HW_TX_PIN, UART5_HW_TX_ALTERNATE_FUNC, GPIO_SPEED_FREQ_LOW);
#endif

#if UART5_HW_FLOW_CONTROL == (USART_CR3_RTSE | USART_CR3_CTSE)
        enableClkGPIO((GPIO_TypeDef *)UART5_HW_RTS_PORT);
        initUartGPIO((GPIO_TypeDef *)UART5_HW_RTS_PORT, UART5_HW_RTS_PIN, UART5_HW_RTS_ALTERNATE_FUNC, GPIO_SPEED_FREQ_VERY_HIGH);
        enableClkGPIO((GPIO_TypeDef *)UART5_HW_CTS_PORT);
        initUartGPIO((GPIO_TypeDef *)UART5_HW_CTS_PORT, UART5_HW_CTS_PIN, UART5_HW_CTS_ALTERNATE_FUNC, GPIO_SPEED_FREQ_VERY_HIGH);
#elif UART5_HW_FLOW_CONTROL == USART_CR3_RTSE
        enableClkGPIO((GPIO_TypeDef *)UART5_HW_CTS_PORT);
        initUartGPIO((GPIO_TypeDef *)UART5_HW_CTS_PORT, UART5_HW_CTS_PIN, UART5_HW_CTS_ALTERNATE_FUNC, GPIO_SPEED_FREQ_VERY_HIGH);
#elif UART5_HW_FLOW_CONTROL == USART_CR3_CTSE
        enableClkGPIO((GPIO_TypeDef *)UART5_HW_RTS_PORT);
        initUartGPIO((GPIO_TypeDef *)UART5_HW_RTS_PORT, UART5_HW_RTS_PIN, UART5_HW_RTS_ALTERNATE_FUNC, GPIO_SPEED_FREQ_VERY_HIGH);
#endif
    }

#endif

    uartHw_t* uartHw = getUartHwByHalHandle(huart);
    if (uartHw->dma.dmaHandleRx.Instance != NULL) {
        uint32_t dmaRequest = 0;
        //@todo in next release need to detectd GPDMA1 or GPDMA2 , because in current MCU GPDMA1_REQUEST equal GPDMA2_REQUEST but in next mcu its can be differents.
        if (uartHw->huart.Instance == USART1)
            dmaRequest = GPDMA1_REQUEST_USART1_RX;
        else if (uartHw->huart.Instance == USART2)
            dmaRequest = GPDMA1_REQUEST_USART2_RX;
        else if (uartHw->huart.Instance == USART3)
            dmaRequest = GPDMA1_REQUEST_USART3_RX;
        else if (uartHw->huart.Instance == UART4)
            dmaRequest = GPDMA1_REQUEST_UART4_RX;
        else if (uartHw->huart.Instance == UART5)
            dmaRequest = GPDMA1_REQUEST_UART5_RX;
        else if (uartHw->huart.Instance == USART6)
            dmaRequest = GPDMA1_REQUEST_USART6_RX;

        if (uartHw->cirularMode) {
            initDmaCircularForUART(&uartHw->dma.dmaHandleRx, dmaRequest, 0);
        }
        else {
            initDmaForUART(&uartHw->dma.dmaHandleRx, dmaRequest, 0);
        }
    }
    if (uartHw->dma.dmaHandleTx.Instance != NULL) {
        uint32_t dmaRequest = 0;
        //@todo in next release need to detectd GPDMA1 or GPDMA2 , because in current MCU GPDMA1_REQUEST equal GPDMA2_REQUEST but in next mcu its can be differents.
        if (uartHw->huart.Instance == USART1)
            dmaRequest = GPDMA1_REQUEST_USART1_TX;
        else if (uartHw->huart.Instance == USART2)
            dmaRequest = GPDMA1_REQUEST_USART2_TX;
        else if (uartHw->huart.Instance == USART3)
            dmaRequest = GPDMA1_REQUEST_USART3_TX;
        else if (uartHw->huart.Instance == UART4)
            dmaRequest = GPDMA1_REQUEST_UART4_TX;
        else if (uartHw->huart.Instance == UART5)
            dmaRequest = GPDMA1_REQUEST_UART5_TX;
        else if (uartHw->huart.Instance == USART6)
            dmaRequest = GPDMA1_REQUEST_USART6_TX;

        initDmaForUART(&uartHw->dma.dmaHandleTx, dmaRequest, 0);
    }

}

void deinitUartHw(uartHw_t *uartHw) {
    if (uartHw == NULL)
        return;
}

static void enableClkGPIO(GPIO_TypeDef *port) {
    if (port == GPIOA) {
        __HAL_RCC_GPIOA_CLK_ENABLE();
    } else if (port == GPIOB) {
        __HAL_RCC_GPIOB_CLK_ENABLE();
    } else if (port == GPIOC) {
        __HAL_RCC_GPIOC_CLK_ENABLE();
    } else if (port == GPIOD) {
        __HAL_RCC_GPIOD_CLK_ENABLE();
    } else if (port == GPIOE) {
        __HAL_RCC_GPIOE_CLK_ENABLE();
    } else if (port == GPIOH) {
        __HAL_RCC_GPIOH_CLK_ENABLE();
    }
}


void initUartGPIO(GPIO_TypeDef *port, uint32_t pin, uint8_t alternateFunction, uint8_t gpioSpeed) {

    GPIO_InitTypeDef GPIO_InitStruct = {0};

    GPIO_InitStruct.Pin = pin;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = gpioSpeed;
    GPIO_InitStruct.Alternate = alternateFunction;
    HAL_GPIO_Init(port, &GPIO_InitStruct);

}


void initDmaForUART(DMA_HandleTypeDef *dmaHandle, uint32_t DMA_REQUEST, uint32_t DMA_CCR) {
    dmaHandle->Init.Request = DMA_REQUEST;
    dmaHandle->Init.BlkHWRequest = DMA_BREQ_SINGLE_BURST;

    if (dmaUsingFor(dmaHandle->Instance) == DMA_USING_FOR_TX) {
        dmaHandle->Init.Direction = DMA_MEMORY_TO_PERIPH;
        dmaHandle->Init.SrcInc = DMA_SINC_INCREMENTED;
        dmaHandle->Init.DestInc = DMA_DINC_FIXED;
        dmaHandle->Init.SrcDataWidth = DMA_SRC_DATAWIDTH_BYTE;
        dmaHandle->Init.DestDataWidth = DMA_DEST_DATAWIDTH_BYTE;
        dmaHandle->Init.Priority = DMA_CCR;
        dmaHandle->Init.SrcBurstLength = 1;
        dmaHandle->Init.DestBurstLength = 1;
        dmaHandle->Init.TransferAllocatedPort = DMA_SRC_ALLOCATED_PORT1|DMA_DEST_ALLOCATED_PORT0;
        dmaHandle->Init.TransferEventMode = DMA_TCEM_BLOCK_TRANSFER;
        if (HAL_DMA_Init(dmaHandle) != HAL_OK)
        {
            //@todo for debugging only
            while (1) {

            }
        }
        UART_HandleTypeDef* huart = getUartHalHandleByDMA(dmaHandle->Instance);
        __HAL_LINKDMA(huart, hdmatx, *dmaHandle);

        if (HAL_DMA_ConfigChannelAttributes(dmaHandle, DMA_CHANNEL_NPRIV) != HAL_OK)
        {
            //@todo for debugging only
            while (1) {

            }
        }
    }
    else if (dmaUsingFor(dmaHandle->Instance) == DMA_USING_FOR_RX) {
        dmaHandle->Init.Direction = DMA_PERIPH_TO_MEMORY;
        dmaHandle->Init.SrcInc = DMA_SINC_FIXED;
        dmaHandle->Init.DestInc = DMA_DINC_INCREMENTED;
        dmaHandle->Init.SrcDataWidth = DMA_SRC_DATAWIDTH_BYTE;
        dmaHandle->Init.DestDataWidth = DMA_DEST_DATAWIDTH_BYTE;
        dmaHandle->Init.Priority = DMA_CCR;
        dmaHandle->Init.SrcBurstLength = 1;
        dmaHandle->Init.DestBurstLength = 1;
        dmaHandle->Init.TransferAllocatedPort = DMA_SRC_ALLOCATED_PORT0|DMA_DEST_ALLOCATED_PORT1;
        dmaHandle->Init.TransferEventMode = DMA_TCEM_BLOCK_TRANSFER;
        if (HAL_DMA_Init(dmaHandle) != HAL_OK)
        {
            //@todo for debugging only
            while (1) {

